{
  "result": {
    "name": "Humanities, Arts, and Social Sciences Interdisciplinary, B.A.",
    "type": "Major",
    "publishDate": "2025-11-18T18:58:11.6070842",
    "receivingInstitution": "{\"id\":46,\"code\":\"UCR     \",\"isCommunityCollege\":false,\"category\":\"UC\",\"termType\":\"Quarter\",\"names\":[{\"name\":\"University of California, Riverside\",\"hasDepartments\":true,\"fromYear\":0,\"hideInList\":false}],\"termTypeAcademicYears\":[{\"termType\":\"Quarter\",\"fromYear\":1980}],\"beginId\":31,\"endId\":null}",
    "sendingInstitution": "{\"id\":113,\"code\":\"DAC     \",\"isCommunityCollege\":true,\"category\":\"CCC\",\"termType\":\"Quarter\",\"names\":[{\"name\":\"De Anza College\",\"hasDepartments\":true,\"fromYear\":0,\"hideInList\":false}],\"termTypeAcademicYears\":[{\"termType\":\"Quarter\",\"fromYear\":1980}],\"beginId\":31,\"endId\":null}",
    "academicYear": "{\"id\":76,\"code\":\"2025-2026\",\"beginDate\":\"2025-10-01T00:00:00\",\"endDate\":\"2026-10-01T00:00:00\",\"isOpenForMaintenance\":true,\"isOpenForPublic\":true,\"isOpenForReporting\":true,\"isLocked\":false}",
    "templateAssets": [
      {
        "type": "GeneralText",
        "content": "<p>Admission to majors housed in the College of Humanities, Arts and Social Sciences is selective based on GPA in all transferrable coursework, with a minimum GPA of 2.40 (this is a baseline GPA for consideration and not a guarantee of admission). Applicants with 80 semester/120 quarter units or more (e.g. a combination of 4-year and community college course work) are subject to additional screening. Although completion of the course work listed below is not mandatory prior to admission, students are advised to complete as much lower division course preparation as possible prior to transfer. Completion of lower division course work prepares students for upper division work at UCR and helps students move more efficiently towards graduation.</p><p><br></p><p>If sending institution offers <strong><u>honors/enhanced/support courses</u></strong>, the articulation for the same course number will be used.</p><p><br></p><p><strong>IGETC/CAL-GETC and General Education/Breadth Information </strong></p><p>In addition to the lower division requirements listed below, students are also encouraged to complete the IGETC or CAL-GETC while attending community college. Students completing CAL-GETC may have an additional \"Language other than English\" requirement, which can be met with coursework completed at UCR or with applicable transfer credit. Although completion of the IGETC/CAL-GETC is not a UCR admission requirement, it is a good program for students planning to transfer into majors housed in the College of Humanities, Arts and Social Sciences. Information about completing IGETC/CAL-GETC is available at each community college. Students also have the option of completing the UCR CHASS breadth pattern, you may view the breath requirements for by visiting the <a href=\"https://documents.ucr.edu/registrar/UCR%20Catalog%202025-2026.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">2025-26 Catalog</a>, pages 86-87.</p>",
        "groupId": "43ac7645-6887-ef11-8474-000d3a37e3b6",
        "position": 1,
        "area": "General"
      },
      {
        "type": "GeneralText",
        "content": "<p>For information about the UC Transfer Admission Guarantee (TAG) program, please visit <a href=\"https://admission.universityofcalifornia.edu/admission-requirements/transfer-requirements/uc-transfer-programs/transfer-admission-guarantee-tag.html\" rel=\"noopener noreferrer\" target=\"_blank\">Transfer Admission Guarantee</a>.</p>",
        "groupId": "421c6645-6887-ef11-8474-000d3a37e3b6",
        "position": 2,
        "area": "General"
      },
      {
        "type": "GeneralText",
        "content": "<p>Transfer students who wish to pursue this major must first be admitted into UCR first, as students proposing a major must have a faculty advisor who is a member of the UCR Academic Senate. The Humanities and Social Sciences major is an interdisciplinary major designed for students who have specific interests which cannot be accommodated within any one of the departments in the College of Humanities, Arts and Social Sciences, and who wish to construct a coherent program of their own. The Humanities and Social Sciences major is not intended for students whose interests are undecided; students proposing a Humanities and Social Sciences major are required to propose a specifically focused interdisciplinary topic or a two-field area. </p><p><br></p><p>The Humanities and Social Sciences major is fulfilled by a course of studies determined in consultation with an advisor and with the full approval of the chair and three members of the Committee overseeing the major. The student may construct either an interdisciplinary option or a two-field option for the major as described below. Students who wish to select a Humanities and Social Sciences major are required to fill out a form and submit a carefully worded statement of purpose showing meaningful course interrelations. The Humanities and Social Sciences Interdisciplinary Committee considers each proposal in the context of the student's topic and statement of purpose. </p><p><br></p><p>The Interdisciplinary option is built around a central concept in humanities and social sciences. The concept might be a specific culture, country or ethnic group such as French civilization and culture; an age or period such as the Renaissance or the industrial revolution; a great social issue or human problem such as war, revolution, communication; or any other topic which receives significant attention from several disciplines. </p><p><br></p><p>In special circumstances the Committee sponsors a two-field option for the major designed to allow students to combine studies in two disciplines. Such majors are approved only if they cannot be accommodated within a dual major or within the Liberal Studies Program.</p>",
        "groupId": "a0197745-6887-ef11-8474-000d3a37e3b6",
        "position": 4,
        "area": "General"
      },
      {
        "type": "GeneralTitle",
        "content": "lOWER DIVISION MAJOR REQUIREMENTS",
        "groupId": "2aec6545-6887-ef11-8474-000d3a37e3b6",
        "position": 3,
        "area": "General"
      },
      {
        "type": "GeneralTitle",
        "content": "general requirements",
        "groupId": "48fc6f45-6887-ef11-8474-000d3a37e3b6",
        "position": 0,
        "area": "General"
      }
    ],
    "articulations": [],
    "catalogYear": "{\"receivingCatalogYearBegin\":2025,\"receivingCatalogYearEnd\":2026,\"sendingCatalogYearBegin\":2025,\"sendingCatalogYearEnd\":2026}"
  },
  "validationFailure": null,
  "isSuccessful": true
}